13/data/attachments/145dd011b4e82a9d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4909b0cb-4ed9-47b7-8161-21da3fcc2c7d</nif:username>
            <nif:friendToBeAdded>Steven_activity_Friend_18108_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>